In [7]:
#Carregando informações do DB
import sqlite3
import pandas as pd

conexao = sqlite3.connect("database.sqlite3")

df = pd.read_sql_query("SELECT * FROM Cliente", conexao)

In [8]:
df.head(5)

   id           nome  idade  valor_fatura  pagamento
0   1        Sherlon     28       2599.99        1.0
1   2          Teste      0          0.00        1.0
2   3          Naldo     25      15000.00        0.0
3   4    Maria Cunha     96       1574.77        1.0
4   5  Maria Almeida     94       7262.83        0.0

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3013 entries, 0 to 3012
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            3013 non-null   int64
 1   nome          3013 non-null   object
 2   idade         3013 non-null   int64
 3   valor_fatura  3013 non-null   float64
 4   pagamento     2023 non-null   float64
dtypes: float64(2), int64(2), object(1)
memory usage: 117.8+ KB

In [10]:
df.describe()

                id        idade  valor_fatura    pagamento
count  3013.000000  3013.000000   3013.000000  2023.000000
mean   1507.000000    55.117159   7454.726100     0.506673
std     869.922506    25.930272   4427.891194     0.500079
min       1.000000     0.000000   -946.560000     0.000000
25%     754.000000    33.000000   3653.600000     0.000000
50%    1507.000000    55.000000   7475.050000     1.000000
75%    2260.000000    78.000000  11274.480000     1.000000
max    3013.000000   100.000000  15000.000000     1.000000

#Realizar a limpeza de dados

##Removendo dados Nulos

##Removendo Idades Inconsistentes (<18)

##Removendo Valores de Fatura Negativos (< 0)